app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-06-16 09:40:15.706103"], ["updated_at", "2015-06-16 09:40:15.706103"]]

  def destroy
@cart.destroy if @cart.id == session[:cart_id]
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 2]]

    def set_cart
      @cart = Cart.find(params[:id])
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 2]]