app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-06-15 11:12:20.810467"], ["updated_at", "2015-06-15 11:12:20.810467"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["cart_id", 1], ["created_at", "2015-06-15 11:12:20.890296"], ["updated_at", "2015-06-15 11:12:20.890296"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2015-06-16 03:17:24.899521"], ["id", 3]]
---
  def create
product = Product.find(params[:product_id])
@line_item = @cart.add_product(product.id)
    respond_to do |format|
      if @line_item.save

DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 980190962]]
---
  def destroy
    @line_item.destroy

SELECT  "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_line_item
      @line_item = LineItem.find(params[:id])