app/controllers/orders_controller.rb

  def new
    if @cart.line_items.empty?
---
SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT 1  [["cart_id", 17]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 17]]

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-06-18 06:37:51.477290"], ["updated_at", "2015-06-18 06:37:51.477290"]]
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 17]]

  def destroy
    @order.destroy
---
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 3]]