app/controllers/users_controller.rb

SELECT "users".* FROM "users"  ORDER BY "users"."name" ASC
---
  def index
    @users = User.order(:name)

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "dave"], ["password_digest", "$2a$10$4Pcw7sS/4O5QRTUKZPGW1uU0MNZ6b8CMqn1bge.c7TMke7SJ2iHJq"], ["created_at", "2015-06-17 07:18:19.675591"], ["updated_at", "2015-06-17 07:18:19.675591"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    begin
	@user.destroy