app/views/store/index.html.erb

SELECT  "products".* FROM "products"  ORDER BY "products"."updated_at" DESC LIMIT 1
---
<!-- START_HIGHLIGHT -->
<% cache ['store', Product.latest] do %>